In [50]:
import pandas as pd
import numpy as np
from sklearn import tree, metrics
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split

In [51]:
df=pd.read_excel(r"C:\Users\nesha\Desktop\titanic.xlsx")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### The goal is to predict the suvivor status of the passengers using the sex,age, class and the Fare amount they paid!

In [52]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)

inputs=df.drop('Survived', axis='columns')
target=df['Survived']

In [53]:
# to be able to use ML algorithms we need to convert our non-digit data to numbers using mapping

inputs.Sex=inputs.Sex.map({'male':1, 'female':2})

In [54]:
inputs.head()

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    2  38.0  71.2833
2       3    2  26.0   7.9250
3       1    2  35.0  53.1000
4       3    1  35.0   8.0500

In [57]:
# Let's check the Age column and see if we have missing data
inputs.Age[:20]

0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
5      NaN
6     54.0
7      2.0
8     27.0
9     14.0
10     4.0
11    58.0
12    20.0
13    39.0
14    14.0
15    55.0
16     2.0
17     NaN
18    31.0
19     NaN
Name: Age, dtype: float64

In [61]:
# LEt's drop the missing data

inputs.Age=inputs.Age.fillna(inputs.Age.mean())

In [62]:
inputs.head()

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    2  38.0  71.2833
2       3    2  26.0   7.9250
3       1    2  35.0  53.1000
4       3    1  35.0   8.0500

In [64]:
# now lets create and train our model

#breaking thei input to test and training sets
x_train,x_test,y_train,y_test= train_test_split(inputs,target,test_size=0.2)

In [65]:
print("training set shape:", x_train.shape)
print("testing set shape:", x_test.shape)
print("y_train shape:",y_train.shape)
print("y_test shape:", y_test.shape)

training set shape: (712, 4)
testing set shape: (179, 4)
y_train shape: (712,)
y_test shape: (179,)

In [66]:
model=tree.DecisionTreeClassifier()
model.fit(x_train,y_train)

DecisionTreeClassifier()

In [71]:
predictions=model.predict(x_test)

model.score(x_test,y_test)

0.7877094972067039

#### The accuracy score of the model is 78.7%